movielist_rails/easy-blog/app/controllers/movielists_controller.rb

SELECT "movielists".* FROM "movielists"
---
  def index
    @movielists = Movielist.all

INSERT INTO "movielists" ("name", "description", "director", "languagestring", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @movielist = Movielist.new(movielist_params)

    respond_to do |format|
      if @movielist.save

SELECT "movielists".* FROM "movielists" WHERE "movielists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_movielist
      @movielist = Movielist.find(params[:id])