rails_blogarticle/userreg/app/controllers/blog_controller.rb

SELECT "blogs".* FROM "blogs"
---
    def index
        render json: Blog.all

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        v = Blog.find(params[:id])

INSERT INTO "blogs" ("title", "created_at", "updated_at", "content", "imagelink") VALUES (?, ?, ?, ?, ?)  [["title", "Seven wonders"], ["created_at", "2023-01-12 12:15:11.946074"], ["updated_at", "2023-01-12 12:15:11.946074"], ["content", "Below are 7 wonders of world"], ["imagelink", "dummylink3"]]
---
    def create
        puts params[:title]
        puts params[:content]
        puts params[:imagelink]
        v = !params[:title].empty?
        if (v)
            p =  Blog.create('title': params[:title], 'content': params[:content], 'imagelink': params[:imagelink])